Revit 2027 API
PipingSystem.SystemType Property
The type of this piping system.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeSystemType SystemType { get; }
Public ReadOnly Property SystemType As PipeSystemType
	Get
public:
property PipeSystemType SystemType {
	PipeSystemType get ();
}
member SystemType : PipeSystemType with get
Property Value
PipeSystemType
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace